## Plan Result (staging - TerraformPlanApply)




<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.DLRM_sa
  * azurerm_role_assignment.synapse_sa
  * azurerm_synapse_role_assignment.anotherone
* Update
  * azurerm_linux_function_app.funcapp
  * module.storage.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_function_app.funcapp will be updated in-place
  ~ resource "azurerm_linux_function_app" "funcapp" {
      ~ app_settings                                   = {
          - "BUILD_FLAGS"                    = "UseExpressBuild" -> null
          - "ENABLE_ORYX_BUILD"              = "true" -> null
          - "SCM_DO_BUILD_DURING_DEPLOYMENT" = "1" -> null
          - "XDG_CACHE_HOME"                 = "/tmp/.cache" -> null
        }
        id                                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Web/sites/baubais-stg-functionapp"
        name                                           = "baubais-stg-functionapp"
        tags                                           = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_role_assignment.DLRM_sa will be created
  + resource "azurerm_role_assignment" "DLRM_sa" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/synapsebaubaisstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.synapse_sa will be created
  + resource "azurerm_role_assignment" "synapse_sa" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c9985b3-1f04-4701-b9d3-dc01b1dc610e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/synapsebaubaisstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_synapse_role_assignment.anotherone will be created
  + resource "azurerm_synapse_role_assignment" "anotherone" {
      + id                   = (known after apply)
      + principal_id         = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + role_name            = "Synapse Administrator"
      + synapse_workspace_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Synapse/workspaces/baubais-synapse-stg"
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/synapsebaubaisstg"
        name                               = "synapsebaubaisstg"
        tags                               = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Target":"staging - TerraformPlanApply","Vars":{}} -->